[
	{
		"id" : 1,
		"name" : "Chili",
		"description" : "This is an American adaptation of a Mexican classic. This is a recipe that my mother (she's the best!) introduced me to but I have since \"improved\" the recipe to suit my tastes. Let's get to it!",
		"cuisine" : "American",
		"type" : [
			"Main",
			"Soup"
		],
		"measurements" : {
				"Crushed Tomatoes" : "Two 28 ounce cans",
				"Ground Sirloin" : "Two pounds",
				"Black Chili Beans" : "Two 15 ounce cans",
				"Chili Pinto Beans" : "Two 15 ounce cans",
				"Garbanzo Beans" : "One 15 ounce can drained",
				"White Onion" : "One whole",
				"Jalepeno Peppers" : "Three",
				"Chili Powder" : "One tablespoon",
				"Ground Cumin" : "One teaspoon",
				"Cayenne Powder" : "One quarter of a tablespoon",
				"Garlic Powder" : "One quarter of a tablespoon",
				"Salt" : "One teaspoon",
				"Black Pepper" : "One quarter of a teaspoon",
				"Brown Sugar" : "To taste",
				"Sriracha" : "To taste"
		},
		"directions" : [
			"Combine the chili powder, ground cumin, cayenne powder, garlic powder, salt, and black pepper in a small bowl.",
			"Mix the spices to combine and set to the side.",
			"Chop the onion and jalepeno peppers.",
			"Toss the onion and peppers into an oiled dutch oven and cook until translucent.",
			"Place the ground sirloin into the same dutch oven and mix the onions and peppers into the beef.",
			"Cook the beef until cooked through and caramelized.",
			"Stir in the spice mixture and mix until well combined.",
			"Stir in the crushed tomatoes.",
			"Stir in the beans.",
			"Stir in the brown sugar.",
			"Stir in the sriracha.",
			"Bring the mixture to a simmer and allow to cook for up to four hours stirring occasionally."
		],
		"difficulty" : 0
	},
	{
		"id" : 2,
		"name" : "Southwestern Chicken Soup",
		"description" : "This is another one of the recipes my mother introduced me to. This recipe uses a unique ingredient, hominy, which is delicious. Hominy is corn that has a potato like texture. It's delicious. Let's dig in!",
		"cuisine" : "Mexican",
		"type" : [
			"Main",
			"Soup"
		],
		"Measurements" : {
			"Chicken" : "One whole",
			"Hominy" : "One 25 ounce can",
			"Diced Tomatoes and Green Chilis" : "One 10 ounce can",
			"Green Onions" : "One bunch",
			"Cilantro" : "One bunch",
			"Yellow Onion" : "One",
			"Celery" : "Three or four stalks",
			"Carrots" : "Three or four",
			"Lime" : "One",
			"Water" : "Unspecified"
		},
		"directions" : [
			"Roughly chop the carrots, yellow onion, and celery.",
			"Place the chopped vegetables into a large pot.",
			"Place the whole chicken - and any of those nasty bits, i.e. heart, neck, etc. - into the pot on top of the vegetables.",
			"Take the pot over to the sink and slowly cover the chicken and vegetables in room temperature water.",
			"Take the pot back over to the stove and bring to a boil.",
			"Allow to cook until the chicken is cooked through. About 1.5 hours.",
			"While the chicken is boiling, finely chop the cilantro and set to the side.",
			"Slice the green onions into thin rings, ignoring the fibrous ends.",
			"Once the chicken is fully cooked, remove the chicken from the newly formed broth and set to the side allowing it to cool.",
			"Strain out all of the nasty chicken bits and used up vegetables and lower to a simmer.",
			"Add the hominy, green chilis, green onions, and cilantro to the broth.",
			"Pull apart the chicken, removing any of the bones and grody bits.",
			"Roughly chop the chicken so that there are chunks of chicken.",
			"Reintroduce the chicken into the broth.",
			"Allow to simmer together for a few minutes."
		],
		"difficulty" : 0
	}
]